Repository: walteram/waveletstudio
Catalog: trunk/src/WaveletStudio/Properties/Resources.*.resx
Languages: pt_br

# AmplitudeDescription
source: Amplitude of the signal.
pt_br: Amplitude do Sinal.

source: Column separator
pt_br: Separador de Colunas

# ColumnSeparatorDescription
source: Column separator value (, |, etc).
pt_br: Caracter separador de colunas (, |, etc).

source: Convolution Mode
pt_br: Modo de Convolução

source: Decimal Places
pt_br: Casas decimais

# DecimalPlacesDescription
source: Number of decimal places.
pt_br: Número de casas decimais.

source: Delay
pt_br: Atraso

# DelayDescription
source: Time delay.
pt_br: Tempo de atraso.

# dynamictrigonometricvalues
source: Dynamic (slower, uses less memory)
pt_br: Dinâmico (mais lento, usa menos memória)

# errorinvalidoriginalsignal
source: Before performing any operation is necessary to select a source. Click in the Signal tab and select a signal source.
pt_br: Antes de executar qualquer operação é necessário selecionar a origem. Clique na aba Sinal e selecione uma origem de sinal.

source: Extension Mode
pt_br: Modo de Extensão

# ExtensionModeDescription
source: Defines how the signal should be extended during the transform.
pt_br: Define como o sinal será extendido.

source: Extension Size
pt_br: Largura da Extensão

# ExtensionSizeDescription
source: Extension size (0 to use next power of 2).
pt_br: Largura da extensão (0 para usar a próxima potência de 2).

source: Factor
pt_br: Fator

# FactorDescription
source: Factor used in the operation.
pt_br: Fator usado na operação.

# FilePath
source: File
pt_br: Arquivo

# FilePathDescription
source: Absolute or relative path to the file.
pt_br: Caminho absoluto ou relativo para o arquivo.

# Finish
source: Finish Time
pt_br: Tempo de Término

# FinishDescription
source: Signal finish time.
pt_br: Término do sinal no tempo.

source: Frame Size
pt_br: Largura do Quadro

# FrameSizeDescription
source: The frame size used in the block.
pt_br: Largura do quadro utilizada pelo bloco.

# Frequency
source: Frequency (Hz)
pt_br: Frequência (Hz)

# FrequencyDescription
source: Frequency used in the block.
pt_br: Frequência utilizada pelo bloco.

source: Ignore first row
pt_br: Ignorar a primeira linha

# IgnoreFirstRowDescription
source: Ignore first row when reading the file.
pt_br: Ignora a primeira linha do arquivo (cabeçalho).

# IgnoreLastSample
source: Ignore the last sample
pt_br: Ignorar última amostra

# IgnoreLastSampleDescription
source: Defines whether the last sample will be included in signal.
pt_br: Define se a última amostra será incluída no sinal.

source: Include Signal Name in First Column
pt_br: Incluir nome do sinal na primeira coluna

# IncludeSignalNameInFirstColumnDescription
source: If true, the block includes the signal name in first column.
pt_br: Informa se o bloco deverá incluir o nome do sinal na primeira coluna.

# InputCount
source: Number of Inputs
pt_br: Número de Entradas

# InputCountDescription
source: Number of inputs of the block.
pt_br: Número de entradas do bloco.

source: Keep Sampling Rate
pt_br: Manter taxa de amostragem

# KeepSamplingRateDescription
source: If true, keeps the original sampling rate, changing the signal start and finish times.
pt_br: Informa se o bloco deverá manter a taxa de amostragem original, alterando o tempo de início e término do sinal.

source: Level
pt_br: Nível

# LevelDescription
source: Number of levels to decompose.
pt_br: Número de níveis a decompor.

source: Mean
pt_br: Média

# MeanDescription
source: Mean value used in the block.
pt_br: Valor médio utilizado no bloco.

source: Mode
pt_br: Moda

# ModeDescription
source: Mode used in the block.
pt_br: Valor de moda utilizado no bloco.

source: Offset
pt_br: Deslocamento

# OffsetDescription
source: Distance from the origin.
pt_br: Distância da origem.

source: Operation
pt_br: Operação

# OperationDescription
source: Math operation used in the block.
pt_br: Operação matemática a ser aplicada.

# OutputCount
source: Number of Outputs
pt_br: Número de Saídas

# OutputCountDescription
source: Number of outputs of the block.
pt_br: Número de saídas do bloco.

source: Phase
pt_br: Fase

# PhaseDescription
source: Phase used in the block.
pt_br: Fase a ser utilizada pelo bloco.

source: Processing Type
pt_br: Modo de Processamento

# ProcessingTypeDescription
source: Type of action done by the block.
pt_br: Define a ação a ser tomada pelo bloco.

source: Ramp Finish
pt_br: Final da Rampa

# RampFinishDescription
source: Finish of the ramp in time.
pt_br: Tempo onde a rampa terá seu término.

source: Ramp Start
pt_br: Início da Rampa

# RampStartDescription
source: Ramp start time.
pt_br: Tempo onde a rampa terá seu início.

source: Repetition Count
pt_br: Número de Repetições

# RepetitionCountDescription
source: The repetition count used in the block.
pt_br: Quantidade de vezes que o bloco deverá repetir o sinal.

# ReturnOnlyValid
source: Return only valid samples
pt_br: Retornar apenas amostras válidas

# ReturnOnlyValidDescription
source: If true, the block returns only the valid samples (central area).
pt_br: Define se o bloco deverá retornar apenas as amostras válidas (área central)

source: Return to Zero
pt_br: Retornar a Zero

# ReturnToZeroDescription
source: Return value to zero in the end.
pt_br: Retorna o valor para zero ao final.

# SamplingInterval
source: Sample time interval
pt_br: Intervalo de amostragem

# SamplingIntervalDescription
source: Sample time interval used in the block.
pt_br: Intervalo de amostragem utilizado no bloco.

# SamplingRate
source: Sampling Rate (Hz)
pt_br: Taxa de Amostragem (Hz)

# SamplingRateDescription
source: Sampling rate used on sampling.
pt_br: Taxa de amostragem utilizada no bloco.

# scalaroperation_text
source: Scalar
pt_br: Valor

source: Signal Indexes
pt_br: Índices do Sinal

# SignalIndexesDescription
source: Indexes of the signals to be copied in the output. One line per output, separated with commas (,).
pt_br: Índices do sinal a serem copiados para a saída. Uma linha por saída, separados por vírgulas.

# SignalNameInFirstColumn
source: First column contains signal name
pt_br: Nome do sinal na primeira coluna

# SignalNameInFirstColumnDescription
source: If true, the first column contains the name of the signal.
pt_br: A primeira coluna do texto contém o nome do sinal.

source: Signal Names
pt_br: Nomes dos Sinais

# SignalNamesDescription
source: Signal names used in the output (optional, one per line).
pt_br: Nomes dos sinais na saída do bloco (opcional, um por linha).

source: Signal Start
pt_br: Início

# SignalStartDescription
source: Signal start time.
pt_br: Tempo de início do sinal.

source: Signal Templates
pt_br: Modelos de Sinal

source: Sort Samples
pt_br: Ordenar amostras

# SortSamplesDescription
source: If true, the block will sort the samples before execute.
pt_br: Ordena as amostras do sinal em ordem crescente.

source: Standard Deviation
pt_br: Desvio Padrão

# StandardDeviationDescription
source: Standard deviation value used in the block.
pt_br: Valor de desvio padrão utilizado no bloco.

# Start
source: Start Time
pt_br: Início

# StartDescription
source: Signal start time.
pt_br: Tempo de início do sinal.

source: Static Threshold
pt_br: Limite

# StaticThresholdDescription
source: Assign the switch threshold that determines which input the block passes to the output.
pt_br: Define o limite que definirá qual bloco será passado para a saída do bloco.

source: Switch Criteria
pt_br: Critério

# SwitchCriteriaDescription
source: Criteria for select the output.
pt_br: Critério para definir qual sinal será passado para a saída do bloco.

# TemplateName
source: Template
pt_br: Modelo

# TemplateNameDescription
source: The signal generation template used by the block.
pt_br: Modelo de geração de sinal a ser utilizado pelo bloco.

source: Text
pt_br: Texto

# TextDescription
source: Text used in the block.
pt_br: Texto utilizado no bloco.

# uselookuptable
source: Use trigonometric table (faster)
pt_br: Utilizar tabela trigonométrica (mais rápido)

source: Value
pt_br: Valor

# ValueDescription
source: Scalar value.
pt_br: Valor escalar.

source: Wavelet Name
pt_br: Wavelet

# WaveletNameDescription
source: Wavelet function to be used.
pt_br: Função Wavelet mãe a ser utilizada.

source: Absolute
pt_br: Módulo

# AbsoluteDescription
source: Absolute value of a signal.
pt_br: Valor absoluto do sinal.

source: Output
pt_br: Saída

source: Signal
pt_br: Sinal

source: Absolute Value
pt_br: Valor Absoluto

source: All
pt_br: Tudo

source: Approximation
pt_br: Aproximação

source: Approximation Level
pt_br: Nível de Aproximação

source: Convolution
pt_br: Convolução

# DemuxDescription
source: Extract and output elements of vector signal.
pt_br: Extrai elementos de um vetor de sinais.

source: Details
pt_br: Detalhes

source: Details Level
pt_br: Nível de Detalhamento

source: Downsample
pt_br: Sub-amostragem

# DownsampleDescription
source: Decreases the sampling rate of the input by keeping every odd sample starting with the first sample.
pt_br: Diminui a taxa de amostragem de um sinal removendo as amostras em posições pares do sinal.

# DWTDescription
source: Wavelet decomposition block
pt_br: Decomposição Wavelet

# ExportToCSV
source: Export CSV
pt_br: Arquivo CSV

# ExportToCSVDescription
source: Exports a signal to a CSV file
pt_br: Exporta um sinal para um arquivo CSV

# FFTDescription
source: Compute fast Fourier transform (FFT) of input.
pt_br: Calcula a Transformada Rápida de Fourier (FFT) de um sinal

source: FFT Mode
pt_br: Modo FFT

# FFTModeDescription
source: The FFT mode to be used on convolution.
pt_br: Modo de operação FFT a ser utilizado durante a convolução.

# IDWTDescription
source: Inverse Wavelet Decomposition (IDWT) block.
pt_br: Reconstrução Wavelet (IDWT).

# IFFTDescription
source: Compute inverse fast Fourier transform (IFFT) of input.
pt_br: Calcula a Transformada Inversa de Fourier (IFFT) de um sinal.

# ImportFromCSV
source: Import CSV
pt_br: Arquivo CSV

# ImportFromCSVDescription
source: Generates a signal based on a CSV file.
pt_br: Gera um sinal baseado em um arquivo CSV.

source: Input
pt_br: Entrada

source: Line
pt_br: Linha

source: Reconstruction
pt_br: Reconstrução

# TemplateNotFound
source: The template {0} does not exist.
pt_br: O modelo {0} não existe.

# TextBlockDescription
source: Generates a signal based on a text.
pt_br: Gera um sinal através de um texto.

# WaveletNameNotFound
source: The wavelet {0} does not exist.
pt_br: A wavelet-mãe {0} não existe.
